#pragma once

#include "Point.h"

// Angle обозначает угол.
// 
// Angle не обозначает прямоугольник.
//
// Строится по 3м точкам.
class Angle {
private:
    Point a, b, c;
public:
    /*
     * @brief Конструктор, инициализирующий угол заданными тремя точками.
     * @param a Первая точка (A) угла.
     * @param b Вторая точка (B) угла (вершина).
     * @param c Третья точка (C) угла.
     */
    Angle(const Point& a, const Point& b, const Point& c);

    /*
     * @brief Проверяет, является ли угол ABC прямым.
     * @return true, если угол ABC - прямой; false в противном случае.
     *
     * Угол считается прямым, если скалярное произведение векторов BA и BC равно нулю.
     * Для проверки используется небольшой порог (epsilon) для учета возможных ошибок округления.
     */
    bool isRight() const;
};
