#pragma once

#include <string>
#include <iostream>

/*
 * @brief Абстрактный базовый класс для двумерных фигур.
 * 
 * Этот класс предоставляет интерфейс для всех двумерных фигур.
 * Он содержит чисто виртуальную функцию ToString(), которая должна
 * быть реализована в производных классах для предоставления строкового
 * представления фигуры.
 */
class Figure2D {
public:
/*
 * @brief Возвращает строковое представление фигуры.
 * Чисто виртуальная функция, которая должна быть переопределена
 * в производных классах для предоставления информации о фигуре. 
 * @return Строка, представляющая фигуру.
 */
    virtual std::string ToString() const = 0;

  /*
   * @brief Перегрузка оператора вывода для класса Figure2D. 
   * Позволяет выводить информацию о фигуре в поток вывода. 
   * @param os Поток вывода.
   * @param fig Объект фигуры, который будет выведен.
   * @return Ссылку на поток вывода.
   */
    friend std::ostream& operator<<(std::ostream& os, const Figure2D& fig);
};
