#include "Figure2D.h"

/*
 * @brief Перегрузка оператора вывода для класса Figure2D.
 * Эта функция позволяет выводить информацию о фигуре в поток вывода.
 * Она вызывает метод ToString() объекта фигуры, чтобы получить строковое
 * представление, и выводит его в указанный поток.
 * @param os Поток вывода, в который будет записано строковое представление фигуры.
 * @param fig Объект фигуры, который будет выведен.
 * @return Ссылку на поток вывода, что позволяет использовать оператор цепочки.
 */
std::ostream& operator<<(std::ostream& os, const Figure2D& fig) {
    os << fig.ToString();
    return os;
}
